Repository: Kevin64/Dependencies
Catalog: ConstantsDLL/Properties/LogStrings.*.resx
Languages: pt

# LOG_ACCESS_APCS
source: Accessing APCS
pt: Acessando APCS

# LOG_AD_REGISTERED
source: Active Directory registered
pt: Registrado no Active Directory

# LOG_APCS_REGISTERING
source: Registering on the APCS Server
pt: Registrando no servidor APCS

# LOG_APPFILE_FOUND
source: Found dependency files
pt: Arquivos de dependência encontrados

# LOG_APPFILE_NOT_FOUND
source: One or more missing dependency files
pt: Um ou mais arquivos de dependência ausentes

# LOG_ASSET_NOT_EXIST
source: Asset not present in database
pt: Ativo não presente no banco de dados

# LOG_AUTOTHEME_CHANGE
source: Automatically selecting theme
pt: Selecionando tema automaticamente

# LOG_CHECKING_FOR_UPDATES
source: Checking for updates
pt: Verificando atualizações

# LOG_CLI_MODE
source: Arguments detected, starting in CLI mode. List of arguments
pt: Argumentos detectados, iniciando em modo CLI. Lista de argumentos

# LOG_CLOSING_ABOUTBOX
source: Closing About window
pt: Fechando janela Sobre

# LOG_CLOSING_CLI
source: Ending program sequence
pt: Finalizando sequência do programa

# LOG_CLOSING_LOGIN_FORM
source: Finalizing login form
pt: Finalizando form de login

# LOG_CLOSING_MAIN_FORM
source: Finalizing main form
pt: Finalizando form principal

# LOG_CLOSING_PROCESSOR_FORM
source: Closing processor form
pt: Fechando janela de processador

# LOG_CLOSING_RAM_FORM
source: Closing RAM form
pt: Fechando janela de RAM

# LOG_CLOSING_STORAGE_FORM
source: Closing storage form
pt: Fechando janela de armazenamento

# LOG_CLOSING_UPDATER_FORM
source: Closing updater window
pt: Fechando janela do atualizador

# LOG_CLOSING_VIDEO_CARD_FORM
source: Closing video card form
pt: Fechando janela de placa de vídeo

# LOG_CONNECTING_GITHUB
source: Connecting to GitHub
pt: Conectando ao GitHub

# LOG_DARK_THEME_CHANGE
source: Switching to dark theme
pt: Mudando para tema escuro

# LOG_DEBUG_MODE
source: Running in DEBUG mode
pt: Executando em modo DEBUG

# LOG_END_COLLECTING
source: Completion of hardware collection
pt: Finalização da coleta de hardware

# LOG_FETCHING_ASSET_DATA
source: Searching asset information
pt: Buscando informações do ativo

# LOG_FETCHING_MODEL_DATA
source: Searching hardware model information
pt: Buscando informações de modelo de hardware

# LOG_FIRMWARE_MEDIA_OPERATION_TYPE
source: SATA/M.2 operating mode
pt: Modo de operação SATA/M.2

# LOG_FIRMWARE_TPM
source: TPM version
pt: Versão do TPM

# LOG_FIRMWARE_TYPE
source: Firmware type
pt: Tipo de firmware

# LOG_FIRMWARE_VERSION
source: Firmware version
pt: Versão do firmware

# LOG_FIRMWARE_VIRTUALIZATION_TECHNOLOGY
source: Virtualization Technology
pt: Tecnologia de Virtualização

# LOG_GITHUB_UNREACHABLE
source: GitHub unreachable
pt: GitHub inacessível

# LOG_GUI_MODE
source: Missing arguments, starting in GUI mode
pt: Argumentos ausentes, iniciando em modo GUI

# LOG_HARDWARE_BRAND
source: Brand
pt: Marca

# LOG_HARDWARE_MODEL
source: Model
pt: Modelo

# LOG_HARDWARE_PASSED
source: Compliant configuration, ready for registration
pt: Configuração sem pendências, pronto para registro

# LOG_HARDWARE_SERIAL_NUMBER
source: Serial Number
pt: Número Serial

# LOG_HEADER
source: ------------------------ EXECUTION LOG ------------------------
pt: ------------------------ LOG DE EXECUÇÃO ------------------------

# LOG_INIT
source: Start of execution
pt: Inicio da execução

# LOG_INIT_REGISTRY
source: Starting registration process
pt: Iniciando processo de registro

# LOG_LIGHT_THEME_CHANGE
source: Switching to light theme
pt: Mudando para tema claro

# LOG_LOGIN_FAILED
source: Authentication failed
pt: Falha na autenticação

# LOG_LOGIN_SUCCESS
source: Authentication performed successfully
pt: Autenticação realizada com êxito

# LOG_MODEL_NOT_EXIST
source: Model not present in database
pt: Modelo não presente no banco de dados

# LOG_NETWORK_HOSTNAME
source: Hostname
pt: Nome do Computador

# LOG_NETWORK_IP_ADDRESS
source: Primary IP Address
pt: Endereço IP primário

# LOG_NETWORK_MAC_ADDRESS
source: Primary MAC Address
pt: Endereço MAC primário

# LOG_NO_INTERNET_AVAILABLE
source: No internet connection available
pt: Sem conexão com a Internet disponível

# LOG_OFFLINE_MODE
source: Offline execution mode
pt: Modo de execução offline

# LOG_OFFLINE_SERVER
source: Server is OFFLINE
pt: Servidor está OFFLINE

# LOG_ONLINE_SERVER
source: Server is ONLINE
pt: Servidor está ONLINE

# LOG_OPENING_ABOUTBOX
source: Opening About window
pt: Abrindo janela Sobre

# LOG_OPENING_GITHUB
source: Accessing release on GitHub
pt: Acessando release no GitHub

# LOG_OPENING_LOG
source: Opening event log
pt: Abrindo log de eventos

# LOG_OPENING_PROCESSOR_FORM
source: Opening processor form
pt: Abrindo janela de processador

# LOG_OPENING_RAM_FORM
source: Opening RAM form
pt: Abrindo janela de RAM

# LOG_OPENING_STORAGE_FORM
source: Operning storage form
pt: Abrindo janela de armazenamento

# LOG_OPENING_VIDEO_CARD_FORM
source: Opening video card form
pt: Abrindo janela de placa de vídeo

# LOG_OPERATING_SYSTEM
source: Operating system
pt: Sistema Operacional

# LOG_PARAMETER_FILE_FOUND
source: Parameters file found
pt: Arquivo de parâmetros encontrado

# LOG_PARAMETER_FILE_NOT_FOUND
source: Parameters file not found
pt: Arquivo de parâmetros não encontrado

# LOG_PENDENCY_ERROR
source: Issues detected in the configuration
pt: Pendências detectadas na configuração

# LOG_PINGGING_SERVER
source: Checking server availability
pt: Verificando disponibilidade do servidor

# LOG_PROCESSOR
source: Processor
pt: Processador

# LOG_PROCESSOR_CACHE
source: Processor cache
pt: Cache do processador

# LOG_PROCESSOR_CORES
source: Processor cores
pt: Núcleos do processador

# LOG_PROCESSOR_FREQUENCY
source: Processor frequency
pt: Frequência do processador

# LOG_PROCESSOR_ID
source: Processor ID
pt: ID do processador

# LOG_PROCESSOR_NAME
source: Processor name
pt: Nome do processador

# LOG_PROCESSOR_THREADS
source: Processor threads
pt: Threads do processador

# LOG_RAM_AMOUNT
source: RAM module memory amount
pt: Quantidade de memória do módulo de RAM

# LOG_RAM_FREQUENCY
source: RAM module frequency
pt: Frequência do módulo de RAM

# LOG_RAM_MANUFACTURER
source: RAM module manufacturer
pt: Fabricante do módulo de RAM

# LOG_RAM_PART_NUMBER
source: RAM module part number
pt: Número da parte do módulo de RAM

# LOG_RAM_SERIAL_NUMBER
source: RAM module serial number
pt: Número serial do módulo de RAM

# LOG_RAM_SLOT
source: RAM module slot
pt: Slot do módulo de RAM

# LOG_RAM_TYPE
source: RAM module type
pt: Tipo do módulo de RAM

# LOG_REGISTRY_FINISHED
source: Registration finished
pt: Registro finalizado

# LOG_RELEASE_MODE
source: Running in RELEASE mode
pt: Executando em modo RELEASE

# LOG_SAMEWORD_NOFIRSTREGISTRY
source: One or more 'same' arguments detected, however there is no existing record for the current asset. Computer must be registered first via GUI or via CLI with all command line options correctly filled in
pt: Um ou mais argumentos 'same' detectados, porém não há registro existente para o ativo atual. Computador deve ser registrado primeiramente via GUI ou via CLI com todas as opções de linha de comando corretamente preenchidas

# LOG_SERVER_DATA
source: Server and port
pt: Servidor e porta

# LOG_SERVICES_MADE
source: Services made
pt: Serviços realizados

# LOG_SHOWING_HELP
source: Displaying list of commands
pt: Exibindo lista de comandos

# LOG_START_COLLECTING
source: Collecting asset data
pt: Coletando dados do ativo

# LOG_START_COLLECT_THREAD
source: Initializing collection procedure thread
pt: Inicializando thread de procedimento de coleta

# LOG_STATUS_ERROR
source: <ERROR>
pt: <ERRO>

# LOG_STATUS_INFO
source: <INFORMATION>
pt: <INFORMAÇÃO>

# LOG_STATUS_MISC
source: <MISCELLANEOUS>
pt: <MISCELÂNEA>

# LOG_STATUS_WARNING
source: <WARNING>
pt: <AVISO>

# LOG_STORAGE
source: Storage
pt: Armazenamento

# LOG_STORAGE_CONNECTION
source: Storage device connection
pt: Conexão do dispositivo de armazenamento

# LOG_STORAGE_ID
source: Storage device ID
pt: ID do dispositivo de armazenamento

# LOG_STORAGE_MODEL
source: Storage device model
pt: Modelo do dispositivo de armazenamento

# LOG_STORAGE_SERIAL_NUMBER
source: Storage device serial number
pt: Número serial do dispositivo de armazenamento

# LOG_STORAGE_SIZE
source: Storage device size
pt: Tamanho do dispositivo de armazenamento

# LOG_STORAGE_SMART_STATUS
source: Storage device S.M.A.R.T. status
pt: Status S.M.A.R.T. do dispositivo de armazenamento

# LOG_STORAGE_TYPE
source: Storage device type
pt: Tipo do dispositivo de armazenamento

# LOG_THEME
source: Active theme
pt: Tema ativo

# LOG_THEME_DARK
source: Dark
pt: Escuro

# LOG_THEME_LIGHT
source: Light
pt: Claro

# LOG_UPDATE_CHECK_IMPOSSIBLE
source: Unable to check for updates
pt: Não foi possível verificar por atualizações

# LOG_VIDEO_CARD
source: Video card
pt: Placa de vídeo

# LOG_VIDEO_CARD_ID
source: Video card ID
pt: ID da placa de vídeo

# LOG_VIDEO_CARD_NAME
source: Video card name
pt: Nome da placa de vídeo

# LOG_VIDEO_CARD_RAM
source: Video card memory
pt: Memória da placa de vídeo
